ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_sent_mem_regs.xml
<module id="SENT_MEM" HW_revision="" description="SENT MEM Registers">
	<register id="MDATA" width="32" page="0" offset="0" instances="16" instaddr="4" internal="0" description="Data word 'N' in TPRAM memory. The SENT TPRAM contains fast channel SENT frames whether in FIFO or Direct Map mode. In Direct Map mode, the user must read the SENT frame data out from this memory (refer to the section regarding Receive Modes for more details)">
		<bitfield id="DAT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
